src/test/resources/requestTemplates/xcc/PEMRequest.xml

<S:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Header />
    <S:Body>
        <ns0:PEMStructuredCall xmlns:ns0="http://pewswrapper.xccommerce.com/">
            <posStructReq>
                <header>
                    <continuitySequenceID></continuitySequenceID>
                    <customerChoice></customerChoice>
                    <customerDiscAmt></customerDiscAmt>
                    <customerID>PLBW100265775</customerID>
                    <customerID2></customerID2>
                    <customerLanguage>en</customerLanguage>
                    <customerRate></customerRate>
                    <customerRate2></customerRate2>
                    <customerType>9</customerType>
                    <customerType2></customerType2>
                    <pointsBalance1></pointsBalance1>
                    <pointsBalance2></pointsBalance2>
                    <promoEvalRequest>99</promoEvalRequest>
                    <randomValue></randomValue>
                    <redemptions1></redemptions1>
                    <redemptions2></redemptions2>
                    <requestType>PU</requestType>
                    <totalRefundAmount></totalRefundAmount>
                    <tranDate>20181015</tranDate>
                    <tranRequestTime>161622</tranRequestTime>
                    <tranStartTime>161622</tranStartTime>
                    <tranStoreNumber>1000</tranStoreNumber>
                    <tranTillSequence>OOf219b7c</tranTillSequence>
                    <transType>0</transType>
                    <transactionID></transactionID>
                </header>
                <listAlternateHierarchies>
                    <hierarchy>
                        <hierarchyList>cat581011~cat10171;cat421001~cat10160~cat10164~cat10171;cat421001~cat10160~cat10161;cat421001~cat10001~cat611004~cat841004;cat421001~cat10160~cat10164~cat641008;cat581011~cat10168;cat421001~cat10160~cat10164~cat10168;cat421001~cat10160~cat10164</hierarchyList>
                        <itemIdentifier>600117634</itemIdentifier>
                    </hierarchy>
                </listAlternateHierarchies>
                <listItems>
                    <item>
                        <clearancePhase>C</clearancePhase>
                        <colour>0000028597</colour>
                        <couponItem></couponItem>
                        <customerSelection></customerSelection>
                        <discountable1>1</discountable1>
                        <discountable2></discountable2>
                        <itemClearance>Y</itemClearance>
                        <itemDept></itemDept>
                        <itemDetailNumber>1</itemDetailNumber>
                        <itemHostPrice>4250</itemHostPrice>
                        <itemIdentifier>600117634</itemIdentifier>
                        <itemLevel1>523</itemLevel1>
                        <itemLevel2>{{item.number}}</itemLevel2>
                        <itemLevel3>5235635</itemLevel3>
                        <itemLevel4></itemLevel4>
                        <itemListPrice>4250</itemListPrice>
                        <itemMinimumPrice></itemMinimumPrice>
                        <itemPOSPrice>998</itemPOSPrice>
                        <itemQty>1</itemQty>
                        <itemRegularPrice>4250</itemRegularPrice>
                        <itemTicketPrice></itemTicketPrice>
                        <itemType>1</itemType>
                        <itemVendor>36851</itemVendor>
                        <manualDiscountAmt></manualDiscountAmt>
                        <paidWithPoints></paidWithPoints>
                        <pointable></pointable>
                        <priceAccuracyAmt></priceAccuracyAmt>
                        <promotable>1</promotable>
                        <redeemable></redeemable>
                        <skuType>0</skuType>
                        <specialFlag></specialFlag>
                        <tax1Amount></tax1Amount>
                        <tax2Amount></tax2Amount>
                        <tax3Amount></tax3Amount>
                        <tax4Amount></tax4Amount>
                        <weight></weight>
                    </item>
                    <item>
                        <clearancePhase></clearancePhase>
                        <couponItem></couponItem>
                        <customerSelection></customerSelection>
                        <discountable1>1</discountable1>
                        <discountable2></discountable2>
                        <itemClearance></itemClearance>
                        <itemDept></itemDept>
                        <itemDetailNumber>2</itemDetailNumber>
                        <itemHostPrice>795</itemHostPrice>
                        <itemIdentifier>900001</itemIdentifier>
                        <itemLevel1></itemLevel1>
                        <itemLevel2></itemLevel2>
                        <itemLevel3></itemLevel3>
                        <itemLevel4></itemLevel4>
                        <itemListPrice>795</itemListPrice>
                        <itemMinimumPrice></itemMinimumPrice>
                        <itemPOSPrice>795</itemPOSPrice>
                        <itemQty>1</itemQty>
                        <itemRegularPrice>795</itemRegularPrice>
                        <itemTicketPrice></itemTicketPrice>
                        <itemType>1</itemType>
                        <itemVendor></itemVendor>
                        <manualDiscountAmt></manualDiscountAmt>
                        <paidWithPoints></paidWithPoints>
                        <pointable></pointable>
                        <priceAccuracyAmt></priceAccuracyAmt>
                        <promotable>1</promotable>
                        <redeemable></redeemable>
                        <skuType>5</skuType>
                        <specialFlag></specialFlag>
                        <tax1Amount></tax1Amount>
                        <tax2Amount></tax2Amount>
                        <tax3Amount></tax3Amount>
                        <tax4Amount></tax4Amount>
                        <weight></weight>
                    </item>
                </listItems>
                <trailer>
                    <totalDetailCount>2</totalDetailCount>
                </trailer>
            </posStructReq>
        </ns0:PEMStructuredCall>
    </S:Body>
</S:Envelope>